math/2mm.org
#+TITLE: Mathematical methods pt. 2
#+STARTUP: latexpreview , inlineimages

* Fourier series

\[
f(x) = \frac{a_0}{2} + \sum_{r=1}^\infty \left[a_r \cos\left(\frac{2\pi r x}{L}\right) + b_r \sin\left(\frac{2\pi r x}{L}\right)\right]
\]
** Dirichlet conditions

The conditions a function must fulfil in order that it may be expanded as a fourier series.

- The function must be periodic*
- It must be single-valued and continuous, except at a finite number of finite discontinuties
- It must have only have a finite number of maxima and minima within one period
- The integral over one period of |f(x)| must converge

  Then the fourier series will converge to f(x) at all points where f(x) is continuous.

** Properties of fourier series

- Completeness
- All terms are mutually orthogonal

 i.e.

\[
\int_{x_0}^{x_0+L}\sin(2\pi r x / L)\cos(2 \pi p x/L)\dd{x} = 0
\]

for all r and p
\[
\int_{x_0}^{x_0+L}\cos(2\pi r x / L)\cos(2 \pi p x/L)\dd{x} =\begin{cases}
L & r = p = 0 \\
\frac12 L & r = p > 0 \\
0 & r \neq p
\end{cases}
\]

\[
\int_{x_0}^{x_0+L}\sin(2\pi r x / L)\sin(2 \pi p x/L)\dd{x} =\begin{cases}
0 & r = p = 0 \\
\frac12 L & r = p > 0 \\
0 & r \neq p
\end{cases}
\]

where r and p are integers greater than or equal to zero.

** Fourier coefficients

\[
a_r = \frac{2}{L} \int_{x_0}^{x_0+L}f(x)\cos(2\pi r x / L) \dd{x}
\]
\[
b_r = \frac{2}{L} \int_{x_0}^{x_0+L}f(x)\sin(2\pi r x / L) \dd{x}
\]

*** Symmetry about quarter period

if f(x) is even about L/4 then a_odd = 0 and b_even = 0
if f(x) is odd about L/4 then a_2r = 0 and b_odd = 0

** Discontinuous functions

At a discontinuity the value of the fourier series at that point is halfway between the upper and lower values. There is also an overshoot which does not disappear in the limit of an infinite number of terms. This is the *Gibbs' phenomenon*

** Non-periodic functions

Can be extended to non-periodic functions by extending them (in numerous ways), usually to odd or even functions. Care must be taken that it converges properly at possible discontinuities at the ends.

** Integration and differentiation

Try it out!

** Complex fourier series

\[
f(x) = \sum_{r=-\infty}^\infty c_r \exp(2 \pi i r x / L)
\]

\[
c_r = \frac{1}{L}\int_{x_0}^{x_0+L}f(x)\exp(-\frac{2 \pi i r x}{L})\dd{x}
\]

in relation to real fourier coefficients:

\begin{align*}
c_r & = \frac12 (a_r - i b_r) \\
c_{-r} & = \frac12 (a_r + i b_r) \\
\end{align*}

if f(x) is real then $c_{-r} = c_r^*$

** Parseval's theorem

\begin{align*}
\frac{1}{L} \int_{x_0}^{x_0+L}|f(x)|^2 \dd{x} & = \sum_{-\infty}^\infty |c_r|^2 \\
& =(\frac12 a_0)^2 + \frac12 \sum_{r=1}^\infty (a_r^2 + b_r^2)
\end{align*}


* Integral transforms
** Fourier transform

Recall that a periodid function f can be expressed as:

\[
f(t) = \sum_{r=-\infty}^\infty c_r e^{2\pi i r t/ T} = \sum_{r=-\infty}^\infty c_r e^{i\omega_r t}
\]

where $\omega_r = 2\pi r / T$

The fourier transform of f(t):

\[
\tilde{f}(\omega) = \frac{1}{\sqrt{2\pi}} \int_{-\infty}^\infty f(t) e^{-i\omega t} \dd{t}
\]

\[
f(t) = \frac{1}{\sqrt{2\pi}} \int_{-\infty}^\infty \tilde{f}(\omega) e^{i\omega t} \dd{\omega}
\]

*** Dirac delta function

\[
\delta(t-u) = \frac{1}{2\pi} \int_{-\infty}^\infty e^{i\omega (t-u)}\dd{\omega}
\]

\[
\delta(t) = \lim_{\Omega \to \infty} \left(\frac{\sin\Omega t}{\pi t}\right)
\]

\[
\tilde{\delta}(\omega) = \frac{1}{\sqrt{2\pi}}
\]

\[
H'(t) = \delta(t)
\]

*** Properties

- Differentiation

\[
\mathcal{F}[f'(t)] = i\omega \tilde{f}(\omega)
\]

and so on for higher derivatives

- Integration

\[
\mathcal{F}\left[\int^t f(s) \dd{s}\right] = \frac{1}{i\omega}\tilde{f}(\omega) + 2\pi c \delta(\omega)
\]

where c is a constant.

- Scaling

\[
\mathcal{F}[f(at)] = \frac{1}{a}\tilde{f}\left(\frac{\omega}{a}\right)
\]

- Translation

\[
\mathcal{F}[f(t + a)] = e^{ia\omega}\tilde{f}(\omega)
\]

- Exponential multiplication

\[
\mathcal{F}[e^{\alpha t}f(t)] = \tilde{f}(\omega + i\alpha)
\]

where $\alpha \in \mathbb{C}$

*** Odd and even functions

**** Odd

\[
\tilde{f}(\omega) = \sqrt{\frac{2}{\pi}} \int_0^\infty f(t) \sin\omega t \dd{t}
\]

\[
f(t) = \sqrt{\frac{2}{\pi}} \int_0^\infty \tilde{f}(\omega) \sin\omega t \dd{\omega}
\]


For even functions, we can replace sin with cos.

*** Convolution and Deconvolution

\[
h(z) = \int_{-\infty}^\infty f(x)g(z-x) \dd{x}
\]

where f(x) is the 'true' function and g(z-x) is the resolution function.

