exports/math/2mm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mathematical methods pt. 2</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Mathematical methods pt. 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd365f5d">1. Fourier series</a>
<ul>
<li><a href="#org74bb52a">1.1. Dirichlet conditions</a></li>
<li><a href="#orgd3dbffa">1.2. Properties of fourier series</a></li>
<li><a href="#org90cd5ae">1.3. Fourier coefficients</a>
<ul>
<li><a href="#org580fe4e">1.3.1. Symmetry about quarter period</a></li>
</ul>
</li>
<li><a href="#orgf561476">1.4. Discontinuous functions</a></li>
<li><a href="#orge11f5fa">1.5. Non-periodic functions</a></li>
<li><a href="#orgcc0a519">1.6. Integration and differentiation</a></li>
<li><a href="#orge6cf3bb">1.7. Complex fourier series</a></li>
<li><a href="#org2dacc56">1.8. Parseval's theorem</a></li>
</ul>
</li>
<li><a href="#org25ec4ae">2. Integral transforms</a>
<ul>
<li><a href="#orga0e9e30">2.1. Fourier transform</a>
<ul>
<li><a href="#org4c43b8b">2.1.1. Dirac delta function</a></li>
<li><a href="#org3bd14c2">2.1.2. Properties</a></li>
<li><a href="#org308f0dc">2.1.3. Odd and even functions</a></li>
<li><a href="#org5c036cb">2.1.4. Convolution and Deconvolution</a></li>
<li><a href="#orgbb1222e">2.1.5. Parseval's theorem</a></li>
</ul>
</li>
<li><a href="#orgd97c824">2.2. Laplace transform</a>
<ul>
<li><a href="#org1b7d6cb">2.2.1. Standard Lapalace transforms</a></li>
<li><a href="#orgc09bdaa">2.2.2. Laplace transforms of derivatives and integrals</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd48a68e">3. Ordinary Differential equations</a>
<ul>
<li><a href="#orgac372df">3.1. 1st-degree, 1st-order</a>
<ul>
<li><a href="#org66014fa">3.1.1. Seperable-variable equations</a></li>
<li><a href="#org5857ee7">3.1.2. Exact equations</a></li>
<li><a href="#org0e47862">3.1.3. Inexact equations: integrating factors</a></li>
<li><a href="#org8af7f2e">3.1.4. Linear equations</a></li>
<li><a href="#orgbf7e3db">3.1.5. Homogenous equations</a></li>
<li><a href="#orgddc0c6c">3.1.6. Isobaric</a></li>
<li><a href="#orgf018b3a">3.1.7. Bernoulli's equation</a></li>
<li><a href="#org26087c0">3.1.8. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#org236b091">3.2. Higher-degree 1st-order equations</a>
<ul>
<li><a href="#org6bfb9bc">3.2.1. Equations soluble for p</a></li>
<li><a href="#orgf0c946e">3.2.2. Equations soluble for x</a></li>
<li><a href="#org0be0ae5">3.2.3. Equations soluble for y</a></li>
<li><a href="#org1369cee">3.2.4. Clairaut's equation</a></li>
</ul>
</li>
<li><a href="#org9318740">3.3. Higher-order linear equations</a>
<ul>
<li><a href="#org2be5b73">3.3.1. Linear equations with constant coefficients</a></li>
</ul>
</li>
<li><a href="#orge4c27cb">3.4. Linear recurrence relations</a>
<ul>
<li><a href="#orgbcf5087">3.4.1. First-order recurrence relations</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd365f5d" class="outline-2">
<h2 id="orgd365f5d"><span class="section-number-2">1</span> Fourier series</h2>
<div class="outline-text-2" id="text-1">
<p>
\[
f(x) = \frac{a_0}{2} + \sum_{r=1}^\infty \left[a_r \cos\left(\frac{2\pi r x}{L}\right) + b_r \sin\left(\frac{2\pi r x}{L}\right)\right]
\]
</p>
</div>
<div id="outline-container-org74bb52a" class="outline-3">
<h3 id="org74bb52a"><span class="section-number-3">1.1</span> Dirichlet conditions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The conditions a function must fulfil in order that it may be expanded as a fourier series.
</p>

<ul class="org-ul">
<li>The function must be periodic*</li>
<li>It must be single-valued and continuous, except at a finite number of finite discontinuties</li>
<li>It must have only have a finite number of maxima and minima within one period</li>
<li><p>
The integral over one period of |f(x)| must converge
</p>

<p>
Then the fourier series will converge to f(x) at all points where f(x) is continuous.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgd3dbffa" class="outline-3">
<h3 id="orgd3dbffa"><span class="section-number-3">1.2</span> Properties of fourier series</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Completeness</li>
<li><p>
All terms are mutually orthogonal
</p>

<p>
i.e.
</p></li>
</ul>

<p>
\[
\int_{x_0}^{x_0+L}\sin(2\pi r x / L)\cos(2 \pi p x/L)\dd{x} = 0
\]
</p>

<p>
for all r and p
\[
\int_{x_0}^{x_0+L}\cos(2\pi r x / L)\cos(2 \pi p x/L)\dd{x} =\begin{cases}
L & r = p = 0 \\
\frac12 L & r = p > 0 \\
0 & r \neq p
\end{cases}
\]
</p>

<p>
\[
\int_{x_0}^{x_0+L}\sin(2\pi r x / L)\sin(2 \pi p x/L)\dd{x} =\begin{cases}
0 & r = p = 0 \\
\frac12 L & r = p > 0 \\
0 & r \neq p
\end{cases}
\]
</p>

<p>
where r and p are integers greater than or equal to zero.
</p>
</div>
</div>

<div id="outline-container-org90cd5ae" class="outline-3">
<h3 id="org90cd5ae"><span class="section-number-3">1.3</span> Fourier coefficients</h3>
<div class="outline-text-3" id="text-1-3">
<p>
\[
a_r = \frac{2}{L} \int_{x_0}^{x_0+L}f(x)\cos(2\pi r x / L) \dd{x}
\]
\[
b_r = \frac{2}{L} \int_{x_0}^{x_0+L}f(x)\sin(2\pi r x / L) \dd{x}
\]
</p>
</div>

<div id="outline-container-org580fe4e" class="outline-4">
<h4 id="org580fe4e"><span class="section-number-4">1.3.1</span> Symmetry about quarter period</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
if f(x) is even about L/4 then a<sub>odd</sub> = 0 and b<sub>even</sub> = 0
if f(x) is odd about L/4 then a<sub>2r</sub> = 0 and b<sub>odd</sub> = 0
</p>
</div>
</div>
</div>

<div id="outline-container-orgf561476" class="outline-3">
<h3 id="orgf561476"><span class="section-number-3">1.4</span> Discontinuous functions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
At a discontinuity the value of the fourier series at that point is halfway between the upper and lower values. There is also an overshoot which does not disappear in the limit of an infinite number of terms. This is the <b>Gibbs' phenomenon</b>
</p>
</div>
</div>

<div id="outline-container-orge11f5fa" class="outline-3">
<h3 id="orge11f5fa"><span class="section-number-3">1.5</span> Non-periodic functions</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Can be extended to non-periodic functions by extending them (in numerous ways), usually to odd or even functions. Care must be taken that it converges properly at possible discontinuities at the ends.
</p>
</div>
</div>

<div id="outline-container-orgcc0a519" class="outline-3">
<h3 id="orgcc0a519"><span class="section-number-3">1.6</span> Integration and differentiation</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Try it out!
</p>
</div>
</div>

<div id="outline-container-orge6cf3bb" class="outline-3">
<h3 id="orge6cf3bb"><span class="section-number-3">1.7</span> Complex fourier series</h3>
<div class="outline-text-3" id="text-1-7">
<p>
\[
f(x) = \sum_{r=-\infty}^\infty c_r \exp(2 \pi i r x / L)
\]
</p>

<p>
\[
c_r = \frac{1}{L}\int_{x_0}^{x_0+L}f(x)\exp(-\frac{2 \pi i r x}{L})\dd{x}
\]
</p>

<p>
in relation to real fourier coefficients:
</p>

\begin{align*}
c_r & = \frac12 (a_r - i b_r) \\
c_{-r} & = \frac12 (a_r + i b_r) \\
\end{align*}

<p>
if f(x) is real then \(c_{-r} = c_r^*\)
</p>
</div>
</div>

<div id="outline-container-org2dacc56" class="outline-3">
<h3 id="org2dacc56"><span class="section-number-3">1.8</span> Parseval's theorem</h3>
<div class="outline-text-3" id="text-1-8">
\begin{align*}
\frac{1}{L} \int_{x_0}^{x_0+L}|f(x)|^2 \dd{x} & = \sum_{-\infty}^\infty |c_r|^2 \\
& =(\frac12 a_0)^2 + \frac12 \sum_{r=1}^\infty (a_r^2 + b_r^2)
\end{align*}
</div>
</div>
</div>


<div id="outline-container-org25ec4ae" class="outline-2">
<h2 id="org25ec4ae"><span class="section-number-2">2</span> Integral transforms</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga0e9e30" class="outline-3">
<h3 id="orga0e9e30"><span class="section-number-3">2.1</span> Fourier transform</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Recall that a periodid function f can be expressed as:
</p>

<p>
\[
f(t) = \sum_{r=-\infty}^\infty c_r e^{2\pi i r t/ T} = \sum_{r=-\infty}^\infty c_r e^{i\omega_r t}
\]
</p>

<p>
where \(\omega_r = 2\pi r / T\)
</p>

<p>
The fourier transform of f(t):
</p>

<p>
\[
\tilde{f}(\omega) = \frac{1}{\sqrt{2\pi}} \int_{-\infty}^\infty f(t) e^{-i\omega t} \dd{t}
\]
</p>

<p>
\[
f(t) = \frac{1}{\sqrt{2\pi}} \int_{-\infty}^\infty \tilde{f}(\omega) e^{i\omega t} \dd{\omega}
\]
</p>
</div>

<div id="outline-container-org4c43b8b" class="outline-4">
<h4 id="org4c43b8b"><span class="section-number-4">2.1.1</span> Dirac delta function</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
\[
\delta(t-u) = \frac{1}{2\pi} \int_{-\infty}^\infty e^{i\omega (t-u)}\dd{\omega}
\]
</p>

<p>
\[
\delta(t) = \lim_{\Omega \to \infty} \left(\frac{\sin\Omega t}{\pi t}\right)
\]
</p>

<p>
\[
\tilde{\delta}(\omega) = \frac{1}{\sqrt{2\pi}}
\]
</p>

<p>
\[
H'(t) = \delta(t)
\]
</p>
</div>
</div>

<div id="outline-container-org3bd14c2" class="outline-4">
<h4 id="org3bd14c2"><span class="section-number-4">2.1.2</span> Properties</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Differentiation</li>
</ul>

<p>
\[
\mathcal{F}[f'(t)] = i\omega \tilde{f}(\omega)
\]
</p>

<p>
and so on for higher derivatives
</p>

<ul class="org-ul">
<li>Integration</li>
</ul>

<p>
\[
\mathcal{F}\left[\int^t f(s) \dd{s}\right] = \frac{1}{i\omega}\tilde{f}(\omega) + 2\pi c \delta(\omega)
\]
</p>

<p>
where c is a constant.
</p>

<ul class="org-ul">
<li>Scaling</li>
</ul>

<p>
\[
\mathcal{F}[f(at)] = \frac{1}{a}\tilde{f}\left(\frac{\omega}{a}\right)
\]
</p>

<ul class="org-ul">
<li>Translation</li>
</ul>

<p>
\[
\mathcal{F}[f(t + a)] = e^{ia\omega}\tilde{f}(\omega)
\]
</p>

<ul class="org-ul">
<li>Exponential multiplication</li>
</ul>

<p>
\[
\mathcal{F}[e^{\alpha t}f(t)] = \tilde{f}(\omega + i\alpha)
\]
</p>

<p>
where \(\alpha \in \mathbb{C}\)
</p>
</div>
</div>

<div id="outline-container-org308f0dc" class="outline-4">
<h4 id="org308f0dc"><span class="section-number-4">2.1.3</span> Odd and even functions</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<ol class="org-ol">
<li><a id="orgacff41b"></a>Odd<br />
<div class="outline-text-5" id="text-2-1-3-1">
<p>
\[
\tilde{f}(\omega) = \sqrt{\frac{2}{\pi}} \int_0^\infty f(t) \sin\omega t \dd{t}
\]
</p>

<p>
\[
f(t) = \sqrt{\frac{2}{\pi}} \int_0^\infty \tilde{f}(\omega) \sin\omega t \dd{\omega}
\]
</p>


<p>
For even functions, we can replace sin with cos.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5c036cb" class="outline-4">
<h4 id="org5c036cb"><span class="section-number-4">2.1.4</span> Convolution and Deconvolution</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
\[
h(z) = \int_{-\infty}^\infty f(x)g(z-x) \dd{x}
\]
</p>

<p>
where f(x) is the 'true' function and g(z-x) is the resolution function.
</p>
</div>
</div>
