math/2mm.org
*** Parseval's theorem

\[
\int_{-\infty}^\infty \vert f(t) \vert^2 \dd{t} = \int_{-\infty}^\infty \vert \tilde{f}(\omega) \vert^2 \dd{\omega}
\]


** Laplace transform

When a function does not satisfy the dirichlet conditions as it may not converge at infinity or if it is only defined for t > 0. we may want to use the Laplace transform.

\[
\bar{f}(s) = \int_0^\infty f(t)e^{-st}\dd{t}
\]

where we assume s is real. Usually, for a given f(t), there will be some real number $s_0$ such that the integral exists for $s > s_0$ but diverges otherwise.

*** Standard Lapalace transforms

look up a table

*** Laplace transforms of derivatives and integrals

\[
\mathcal{L}\left[\dv[n]{f}{t}\right] = s^n\bar{f} - s^{n-1}f(0) - s^{n-2}f'(0) - \ldots - \dv[n-1]{f}{t}(0), \text{ for s > 0}
\]

\[
\mathcal{L}\left[\int_0^t f(u)\dv{u}\right] = \frac{1}{s}\mathcal{L}[f]
\]



* Ordinary Differential equations

*Order* is the order of the highest derivative it contains
*Degree* is the power to which the highest order derivative is raised (after rationalisation)

** 1st-degree, 1st-order

*** Seperable-variable equations

*Form*:


\[
\dv{y}{x} = f(x)g(y)
\]

*Solution method*:

Factorise when necessary.

\[
\int \frac{\dd{y}}{g(y)} = \int f(x) \dd{x}
\]

*** Exact equations

*Form*:

\[
A(x,y) \dd{x} + B(x,y) \dd{y} = 0
\]

where the expression is an exact differential.

Since $\pdv{A}{y} = \pdv{B}{x}$, we may equate the expression to dU and thus dU = 0, U = c.

*Solution method*:

Make sure to check that its exact.
\[
U(x,y) = \int A(x,y) \dd{x} + F(y)
\]

F(y) can be found by differentiating U wrt y and equating the expression to B(x,y). Then sub back in.

*** Inexact equations: integrating factors

*Form*:

Above but inexact.

The differential can be made exact by multiplying by an *integrating factor* $\mu(x,y)$ which obeys:

\[
\pdv{(\mu A)}{y} = \pdv{(\mu B)}{x}
\]

If the integrating factor is a function of either x or y alone then the eq can be explicitly solved. Assuming $\mu = \mu(x)$:

\begin{align*}
&\mu\pdv{A}{y} =\mu \pdv{B}{x} + B\pdv{\mu}{x} \\
\implies & \frac{\dd{\mu}}{\mu} = \frac{1}{B}\left(\pdv{A}{y}-\pdv{B}{x}\right)\dd{x} = f(x) \dd{x}
\end{align*}

where we require f(x) be a function of x only.

*Solution method*:

In which case,

\[
\mu(x) = \exp\left\{\int f(x) \dd{x}\right\} \text{   where   } f(x) = \frac{1}{B}\left(\pdv{A}{y}-\pdv{B}{x}\right)
\]

\[
\mu(y) = \exp\left\{\int f(y) \dd{y}\right\} \text{   where   } f(y) = \frac{1}{A}\left(\pdv{B}{x}-\pdv{A}{y}\right)
\]

*** Linear equations

Special case of inexact ODEs

*Form*:

\[
\dv{y}{x} + P(x)y = Q(x)
\]

*Solution method*:

\[
\mu(x) = \exp\left\{\int P(x) \dd{x}\right\}
\]

Multiply throughout and then integrate left and right hand sides.
*** Homogenous equations

*Form*:

\[
\dv{y}{x} = \frac{A(x,y)}{B(x,y)} = F\left(\frac{y}{x}\right)
\]

where A(x,y) and B(x,y) are homogenous functions of the same degree. A function is homogenous of degree n if it obeys:


\[
f(\lambda x,\lambda y) = \lambda^n f(x,y)
\]

in general, the sum of the powers of x and y in each term of A and B should be the same.

*Solution method*:

The equation may solved by making the substitution y = vx, so that:

\[
\dv{y}{x} = v + x\dv{v}{x} = F(v)
\].

This is now seperable and can be integrated directly to give:

\[
\int \frac{\dd{v}}{F(v) - v} = \int \frac{\dd{x}}{x}
\]

*** Isobaric

*Form*:

A generalisation of the homogeneous ODE.

\[
\dv{y}{x} = \frac{A(x,y)}{B(x,y)}
\]

where the equation is dimensionally consistent if y and dy are each given a weight m relative to x and dx. i.e. if the substitution y=vx^m makes it seperable

*Solution method*:
Write the equation in the form Adx + Bdy = 0. Given y and dy weight m and x and dx each weight 1. then find an m which makes all the sums equal

*** Bernoulli's equation

*Form*:

\[
\dv{y}{x} + P(x)y = Q(x)y^n \text{ where $n\neq 0$ or $1$}
\]



*Solution method*:

The equation can be made linear by substituting $v = y^{1-n}$ and correspondingly

\[
\dv{y}{x} = \left(\frac{y^n}{1-n}\right) \dv{v}{x}
\]


This can be substituted into the first equation and we find:

\[
\dv{v}{x} + (1-n)P(x)v = (1-n)Q(x)
\]

which is linear and can then be solved.

*** Miscellaneous

**** ax + by + c

*Form*:

\[\dv{y}{x} = F(ax + by + c)\]


*Solution method*:

Letting v = ax + by + c,

\[
  \dv{v}{x} = a + b\dv{y}{x} = a + bF(v)
\]


which can be solved.

**** y' = ax+by+c/ex+fy+g

*Form*:

\[
\dv{y}{x} = \frac{ax + by + c}{ex + fy + g}
\]

unless a/e = b/f where it reduces to the form above.

*Solution method*:

By letting $x = X + \alpha$ and $y = Y + \beta$, where $\alpha$ and $\beta$ are found from:

\[
a\alpha + b\beta + c = 0
\]

\[
e\alpha + f\beta + g = 0
\]

\[
\dv{Y}{X} = \frac{aX + bY}{eX + fY}
\]


** Higher-degree 1st-order equations

Can expressed as:

\[
p^n + a_{n-1}(x,y)p^{n-1} + \ldots + a_1(x,y)p + a_0(x,y) = 0
\]

where $p = \dd{y}/\dd{x}$

Singular solutions are sometimes given which contain no arbitrary constants.

*** Equations soluble for p

If the LHS can be factorised into the form:

\[
(p-F_1)(p-F_2)\ldots(p-F_2)=0
\]

then we are left with solving the n first-degree equations $p = F_i$

*** Equations soluble for x

If the equation can be expressed as:

\[
x = F(y,p)
\]

then it can be reduced to:

\[
\dv{x}{y} = \frac{1}{p} = \pdv{F}{y} + \pdv{F}{p}\dv{p}{y}
\]

which can be factorized


*** Equations soluble for y

If the equation can be expressed as:

\[
x = F(y,p)
\]

then it can be reduced to:

\[
\dv{y}{x} = p = \pdv{F}{x} + \pdv{F}{p}\dv{p}{x}
\]

which can be factorized.

