exports/math/2mm.html

<div id="outline-container-orgbb1222e" class="outline-4">
<h4 id="orgbb1222e"><span class="section-number-4">2.1.5</span> Parseval's theorem</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
\[
\int_{-\infty}^\infty \vert f(t) \vert^2 \dd{t} = \int_{-\infty}^\infty \vert \tilde{f}(\omega) \vert^2 \dd{\omega}
\]
</p>
</div>
</div>
</div>


<div id="outline-container-orgd97c824" class="outline-3">
<h3 id="orgd97c824"><span class="section-number-3">2.2</span> Laplace transform</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When a function does not satisfy the dirichlet conditions as it may not converge at infinity or if it is only defined for t &gt; 0. we may want to use the Laplace transform.
</p>

<p>
\[
\bar{f}(s) = \int_0^\infty f(t)e^{-st}\dd{t}
\]
</p>

<p>
where we assume s is real. Usually, for a given f(t), there will be some real number \(s_0\) such that the integral exists for \(s > s_0\) but diverges otherwise.
</p>
</div>

<div id="outline-container-org1b7d6cb" class="outline-4">
<h4 id="org1b7d6cb"><span class="section-number-4">2.2.1</span> Standard Lapalace transforms</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
look up a table
</p>
</div>
</div>

<div id="outline-container-orgc09bdaa" class="outline-4">
<h4 id="orgc09bdaa"><span class="section-number-4">2.2.2</span> Laplace transforms of derivatives and integrals</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
\[
\mathcal{L}\left[\dv[n]{f}{t}\right] = s^n\bar{f} - s^{n-1}f(0) - s^{n-2}f'(0) - \ldots - \dv[n-1]{f}{t}(0), \text{ for s > 0}
\]
</p>

<p>
\[
\mathcal{L}\left[\int_0^t f(u)\dv{u}\right] = \frac{1}{s}\mathcal{L}[f]
\]
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-orgd48a68e" class="outline-2">
<h2 id="orgd48a68e"><span class="section-number-2">3</span> Ordinary Differential equations</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Order</b> is the order of the highest derivative it contains
<b>Degree</b> is the power to which the highest order derivative is raised (after rationalisation)
</p>
</div>

<div id="outline-container-orgac372df" class="outline-3">
<h3 id="orgac372df"><span class="section-number-3">3.1</span> 1st-degree, 1st-order</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org66014fa" class="outline-4">
<h4 id="org66014fa"><span class="section-number-4">3.1.1</span> Seperable-variable equations</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<b>Form</b>:
</p>


<p>
\[
\dv{y}{x} = f(x)g(y)
\]
</p>

<p>
<b>Solution method</b>:
</p>

<p>
Factorise when necessary.
</p>

<p>
\[
\int \frac{\dd{y}}{g(y)} = \int f(x) \dd{x}
\]
</p>
</div>
</div>

<div id="outline-container-org5857ee7" class="outline-4">
<h4 id="org5857ee7"><span class="section-number-4">3.1.2</span> Exact equations</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<b>Form</b>:
</p>

<p>
\[
A(x,y) \dd{x} + B(x,y) \dd{y} = 0
\]
</p>

<p>
where the expression is an exact differential.
</p>

<p>
Since \(\pdv{A}{y} = \pdv{B}{x}\), we may equate the expression to dU and thus dU = 0, U = c.
</p>

<p>
<b>Solution method</b>:
</p>

<p>
Make sure to check that its exact.
\[
U(x,y) = \int A(x,y) \dd{x} + F(y)
\]
</p>

<p>
F(y) can be found by differentiating U wrt y and equating the expression to B(x,y). Then sub back in.
</p>
</div>
</div>

<div id="outline-container-org0e47862" class="outline-4">
<h4 id="org0e47862"><span class="section-number-4">3.1.3</span> Inexact equations: integrating factors</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
<b>Form</b>:
</p>

<p>
Above but inexact.
</p>

<p>
The differential can be made exact by multiplying by an <b>integrating factor</b> \(\mu(x,y)\) which obeys:
</p>

<p>
\[
\pdv{(\mu A)}{y} = \pdv{(\mu B)}{x}
\]
</p>

<p>
If the integrating factor is a function of either x or y alone then the eq can be explicitly solved. Assuming \(\mu = \mu(x)\):
</p>

\begin{align*}
&\mu\pdv{A}{y} =\mu \pdv{B}{x} + B\pdv{\mu}{x} \\
\implies & \frac{\dd{\mu}}{\mu} = \frac{1}{B}\left(\pdv{A}{y}-\pdv{B}{x}\right)\dd{x} = f(x) \dd{x}
\end{align*}

<p>
where we require f(x) be a function of x only.
</p>

<p>
<b>Solution method</b>:
</p>

<p>
In which case,
</p>

<p>
\[
\mu(x) = \exp\left\{\int f(x) \dd{x}\right\} \text{   where   } f(x) = \frac{1}{B}\left(\pdv{A}{y}-\pdv{B}{x}\right)
\]
</p>

<p>
\[
\mu(y) = \exp\left\{\int f(y) \dd{y}\right\} \text{   where   } f(y) = \frac{1}{A}\left(\pdv{B}{x}-\pdv{A}{y}\right)
\]
</p>
</div>
</div>

<div id="outline-container-org8af7f2e" class="outline-4">
<h4 id="org8af7f2e"><span class="section-number-4">3.1.4</span> Linear equations</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Special case of inexact ODEs
</p>

<p>
<b>Form</b>:
</p>

<p>
\[
\dv{y}{x} + P(x)y = Q(x)
\]
</p>

<p>
<b>Solution method</b>:
</p>

<p>
\[
\mu(x) = \exp\left\{\int P(x) \dd{x}\right\}
\]
</p>

<p>
Multiply throughout and then integrate left and right hand sides.
</p>
</div>
</div>
<div id="outline-container-orgbf7e3db" class="outline-4">
<h4 id="orgbf7e3db"><span class="section-number-4">3.1.5</span> Homogenous equations</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
<b>Form</b>:
</p>

<p>
\[
\dv{y}{x} = \frac{A(x,y)}{B(x,y)} = F\left(\frac{y}{x}\right)
\]
</p>

<p>
where A(x,y) and B(x,y) are homogenous functions of the same degree. A function is homogenous of degree n if it obeys:
</p>


<p>
\[
f(\lambda x,\lambda y) = \lambda^n f(x,y)
\]
</p>

<p>
in general, the sum of the powers of x and y in each term of A and B should be the same.
</p>

<p>
<b>Solution method</b>:
</p>

<p>
The equation may solved by making the substitution y = vx, so that:
</p>

<p>
\[
\dv{y}{x} = v + x\dv{v}{x} = F(v)
\].
</p>

<p>
This is now seperable and can be integrated directly to give:
</p>

<p>
\[
\int \frac{\dd{v}}{F(v) - v} = \int \frac{\dd{x}}{x}
\]
</p>
</div>
</div>

<div id="outline-container-orgddc0c6c" class="outline-4">
<h4 id="orgddc0c6c"><span class="section-number-4">3.1.6</span> Isobaric</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
<b>Form</b>:
</p>

<p>
A generalisation of the homogeneous ODE.
</p>

<p>
\[
\dv{y}{x} = \frac{A(x,y)}{B(x,y)}
\]
</p>

<p>
where the equation is dimensionally consistent if y and dy are each given a weight m relative to x and dx. i.e. if the substitution y=vx<sup>m</sup> makes it seperable
</p>

<p>
<b>Solution method</b>:
Write the equation in the form Adx + Bdy = 0. Given y and dy weight m and x and dx each weight 1. then find an m which makes all the sums equal
</p>
</div>
</div>

<div id="outline-container-orgf018b3a" class="outline-4">
<h4 id="orgf018b3a"><span class="section-number-4">3.1.7</span> Bernoulli's equation</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
<b>Form</b>:
</p>

<p>
\[
\dv{y}{x} + P(x)y = Q(x)y^n \text{ where $n\neq 0$ or $1$}
\]
</p>



<p>
<b>Solution method</b>:
</p>

<p>
The equation can be made linear by substituting \(v = y^{1-n}\) and correspondingly
</p>

<p>
\[
\dv{y}{x} = \left(\frac{y^n}{1-n}\right) \dv{v}{x}
\]
</p>


<p>
This can be substituted into the first equation and we find:
</p>

<p>
\[
\dv{v}{x} + (1-n)P(x)v = (1-n)Q(x)
\]
</p>

<p>
which is linear and can then be solved.
</p>
</div>
</div>

<div id="outline-container-org26087c0" class="outline-4">
<h4 id="org26087c0"><span class="section-number-4">3.1.8</span> Miscellaneous</h4>
<div class="outline-text-4" id="text-3-1-8">
</div>
<ol class="org-ol">
<li><a id="org7bae009"></a>ax + by + c<br />
<div class="outline-text-5" id="text-3-1-8-1">
<p>
<b>Form</b>:
</p>

<p>
\[\dv{y}{x} = F(ax + by + c)\]
</p>


<p>
<b>Solution method</b>:
</p>

<p>
Letting v = ax + by + c,
</p>

<p>
\[
  \dv{v}{x} = a + b\dv{y}{x} = a + bF(v)
\]
</p>


<p>
which can be solved.
</p>
</div>
</li>

<li><a id="org945b3de"></a>y' = ax+by+c/ex+fy+g<br />
<div class="outline-text-5" id="text-3-1-8-2">
<p>
<b>Form</b>:
</p>

<p>
\[
\dv{y}{x} = \frac{ax + by + c}{ex + fy + g}
\]
</p>

<p>
unless a/e = b/f where it reduces to the form above.
</p>

<p>
<b>Solution method</b>:
</p>

<p>
By letting \(x = X + \alpha\) and \(y = Y + \beta\), where \(\alpha\) and \(\beta\) are found from:
</p>

<p>
\[
a\alpha + b\beta + c = 0
\]
</p>

<p>
\[
e\alpha + f\beta + g = 0
\]
</p>

<p>
\[
\dv{Y}{X} = \frac{aX + bY}{eX + fY}
\]
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org236b091" class="outline-3">
<h3 id="org236b091"><span class="section-number-3">3.2</span> Higher-degree 1st-order equations</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Can expressed as:
</p>

<p>
\[
p^n + a_{n-1}(x,y)p^{n-1} + \ldots + a_1(x,y)p + a_0(x,y) = 0
\]
</p>

<p>
where \(p = \dd{y}/\dd{x}\)
</p>

<p>
Singular solutions are sometimes given which contain no arbitrary constants.
</p>
</div>

<div id="outline-container-org6bfb9bc" class="outline-4">
<h4 id="org6bfb9bc"><span class="section-number-4">3.2.1</span> Equations soluble for p</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
If the LHS can be factorised into the form:
</p>

<p>
\[
(p-F_1)(p-F_2)\ldots(p-F_2)=0
\]
</p>

<p>
then we are left with solving the n first-degree equations \(p = F_i\)
</p>
</div>
</div>

<div id="outline-container-orgf0c946e" class="outline-4">
<h4 id="orgf0c946e"><span class="section-number-4">3.2.2</span> Equations soluble for x</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
If the equation can be expressed as:
</p>

<p>
\[
x = F(y,p)
\]
</p>

<p>
then it can be reduced to:
</p>

<p>
\[
\dv{x}{y} = \frac{1}{p} = \pdv{F}{y} + \pdv{F}{p}\dv{p}{y}
\]
</p>

<p>
which can be factorized
</p>
</div>
</div>


<div id="outline-container-org0be0ae5" class="outline-4">
<h4 id="org0be0ae5"><span class="section-number-4">3.2.3</span> Equations soluble for y</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
If the equation can be expressed as:
</p>

<p>
\[
x = F(y,p)
\]
</p>

<p>
then it can be reduced to:
</p>

<p>
\[
\dv{y}{x} = p = \pdv{F}{x} + \pdv{F}{p}\dv{p}{x}
\]
</p>

<p>
which can be factorized.
</p>
</div>
</div>
