math/2mm.org
*** Clairaut's equation

Special case of equations soluble for y.

*Form:*

\[
y = px + F(p)
\]

The general solution is given by $y = c_1 x + F(c_1)$, the singular solution can often be found from the relation:

\[
\dv{F}{p} + x = 0
\]


** Higher-order linear equations

Linear ODE of general order:

\[
a_n(x)\dv[n]{y}{x} + a_{n-1}(x)\dv[n-1]{y}{x} + \ldots +a_1(x)\dv{y}{x} + a_0(x)y = f(x)
\]


An nth order linear ODE must have n linearly independent solutions for the complementary equation. Their linear independence can be confirmed by forming n simultaneous equations for the n constants by repeatedly differentiating them and noticing that RHS is always zero for the complementary solution. This can be constructed as a determinant or the *Wronkskian* of the set of functions. If it does not vanish then the n functions are linearly independent though the converse does not necessarily apply.


*** Linear equations with constant coefficients
The coefficients $a_m$ are constants.

To find the complementary solution try a solution of the form Ae^kx, and we are left with an auxillary equation in k. If all roots are distinct then the solutions are linearly independent and can be superposed. If some roots are complex and all coefficients are real, then it for every complex root its complex conjugate is also a root. If some roots are repeated, then we must try solutions of the form $x^ne^{kx}$ are also solutions.

for particular solutions, use method of undetermined coefficients.

- if f(x) = ae^rx, try be^rx
- if f(x) = a sin(rx) + b cos(rx) (a or b may be zero), then try c sin(rx) + d cos(rx)
- if f(x) = polynomial of degree N, where some coefficients may be zero, then try another polynomial of degree N.


** Linear recurrence relations

Form:

\[
u_{n+1} = \sum_{r=0}^{N-1}a_r u_{n-r} + k
\]

where k may be a simple function of n.

Equations involving terms whose indices differ by up to N are called Nth-order recurrence relations. If k=0, then the relation is called homogenous.

*** First-order recurrence relations

For the equation:

\[
u_{n+1} = au_n + k
\]

the general solution is:

when $a \neq 1$:
\[
u_n = u_0 a^n + k \frac{1-a^n}{1-a}
\]
when a = 1:

\[
u_n = u_0 + nk
\]
