exports/math/2mm.html

<div id="outline-container-org1369cee" class="outline-4">
<h4 id="org1369cee"><span class="section-number-4">3.2.4</span> Clairaut's equation</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Special case of equations soluble for y.
</p>

<p>
<b>Form:</b>
</p>

<p>
\[
y = px + F(p)
\]
</p>

<p>
The general solution is given by \(y = c_1 x + F(c_1)\), the singular solution can often be found from the relation:
</p>

<p>
\[
\dv{F}{p} + x = 0
\]
</p>
</div>
</div>
</div>


<div id="outline-container-org9318740" class="outline-3">
<h3 id="org9318740"><span class="section-number-3">3.3</span> Higher-order linear equations</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Linear ODE of general order:
</p>

<p>
\[
a_n(x)\dv[n]{y}{x} + a_{n-1}(x)\dv[n-1]{y}{x} + \ldots +a_1(x)\dv{y}{x} + a_0(x)y = f(x)
\]
</p>


<p>
An nth order linear ODE must have n linearly independent solutions for the complementary equation. Their linear independence can be confirmed by forming n simultaneous equations for the n constants by repeatedly differentiating them and noticing that RHS is always zero for the complementary solution. This can be constructed as a determinant or the <b>Wronkskian</b> of the set of functions. If it does not vanish then the n functions are linearly independent though the converse does not necessarily apply.
</p>
</div>


<div id="outline-container-org2be5b73" class="outline-4">
<h4 id="org2be5b73"><span class="section-number-4">3.3.1</span> Linear equations with constant coefficients</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
The coefficients \(a_m\) are constants.
</p>

<p>
To find the complementary solution try a solution of the form Ae<sup>kx</sup>, and we are left with an auxillary equation in k. If all roots are distinct then the solutions are linearly independent and can be superposed. If some roots are complex and all coefficients are real, then it for every complex root its complex conjugate is also a root. If some roots are repeated, then we must try solutions of the form \(x^ne^{kx}\) are also solutions.
</p>

<p>
for particular solutions, use method of undetermined coefficients.
</p>

<ul class="org-ul">
<li>if f(x) = ae<sup>rx</sup>, try be<sup>rx</sup></li>
<li>if f(x) = a sin(rx) + b cos(rx) (a or b may be zero), then try c sin(rx) + d cos(rx)</li>
<li>if f(x) = polynomial of degree N, where some coefficients may be zero, then try another polynomial of degree N.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orge4c27cb" class="outline-3">
<h3 id="orge4c27cb"><span class="section-number-3">3.4</span> Linear recurrence relations</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Form:
</p>

<p>
\[
u_{n+1} = \sum_{r=0}^{N-1}a_r u_{n-r} + k
\]
</p>

<p>
where k may be a simple function of n.
</p>

<p>
Equations involving terms whose indices differ by up to N are called Nth-order recurrence relations. If k=0, then the relation is called homogenous.
</p>
</div>

<div id="outline-container-orgbcf5087" class="outline-4">
<h4 id="orgbcf5087"><span class="section-number-4">3.4.1</span> First-order recurrence relations</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
For the equation:
</p>

<p>
\[
u_{n+1} = au_n + k
\]
</p>

<p>
the general solution is:
</p>

<p>
when \(a \neq 1\):
\[
u_n = u_0 a^n + k \frac{1-a^n}{1-a}
\]
when a = 1:
</p>

<p>
\[
u_n = u_0 + nk
\]
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-16 Mon 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
